app/controllers/families_controller.rb

SELECT "families".* FROM "families"
---
  def index
    @families = Family.all

INSERT INTO "families" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "gtest"], ["created_at", "2018-01-28 11:20:14.114701"], ["updated_at", "2018-01-28 11:20:14.114701"]]
---
  def create
    @family = Family.new(family_params)

    respond_to do |format|
      if @family.save

DELETE FROM "families" WHERE "families"."id" = ?  [["id", 1]]
---
  def destroy
    @family.destroy

SELECT  "families".* FROM "families" WHERE "families"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_family
      @family = Family.find(params[:id])